Revit 2027 API
Hardwood Properties
The Hardwood type exposes the following members.
Properties
Name | Description
CommonTintColor |  The property labeled "Tint Color" from the "Hardwood" schema.
CommonTintToggle |  The property labeled "Tint" from the "Hardwood" schema.
HardwoodApplication |  The property labeled "Used For" from the "Hardwood" schema.
HardwoodColor |  The property labeled "Image" from the "Hardwood" schema.
HardwoodFinish |  The property labeled "Finish" from the "Hardwood" schema.
HardwoodImperfections |  The property labeled "Relief Pattern" from the "Hardwood" schema.
HardwoodImperfectionsAmount |  The property labeled "Amount" from the "Hardwood" schema.
HardwoodImperfectionsShader |  The property labeled "Image" from the "Hardwood" schema.
HardwoodTintColor |  The property labeled "Stain Color" from the "Hardwood" schema.
HardwoodTintEnabled |  The property labeled "Stain" from the "Hardwood" schema.
Top
See Also
Reference
Hardwood Class
Autodesk.Revit.DB.Visual Namespace